# GetPaletteVisibility

## Description
Gets the visibility state of a palette.

```pascal
FUNCTION GetPaletteVisibility(paletteName : STRING) : BOOLEAN;
```

```python

def vs.GetPaletteVisibility(paletteName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paletteName|STRING|Name of the palette|

## Returns
Returns true if the palette is visible, false otherwise.

## See Also
VS Functions:
SetPaletteVisibility

## Version
Availability: from VectorWorks10.0
## Category
* Utility